---
type: CorrectionFactor
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 2
tags: [revit-api, class]
---

# CorrectionFactor

`Autodesk.Revit.DB.Electrical.CorrectionFactor` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetTemperature | — | `public double GetTemperature ()` |
| Property | Factor | — | `public double Factor { get ; }` |